games/sample/data/digraph.mmd
%%{init: {"flowchart": {"htmlLabels": false}}}%%
graph LR

subgraph Deku_Tree
    subgraph Deku_Tree__Lobby[Lobby]
        Deku_Tree__Lobby__Entry(Entry);
        Deku_Tree__Lobby__Center(Center);
        Deku_Tree__Lobby__Vines(Vines);
    end
    subgraph Deku_Tree__Floor_2[Floor 2]
        Deku_Tree__Floor_2__Lower(Lower);
        Deku_Tree__Floor_2__Vines(Vines);
        Deku_Tree__Floor_2__Slingshot_Door(Slingshot Door);
    end
    subgraph Deku_Tree__Scrub_Room[Scrub Room]
        Deku_Tree__Scrub_Room__Entry(Entry);
        Deku_Tree__Scrub_Room__Rear(Rear);
    end
    subgraph Deku_Tree__Slingshot_Room[Slingshot Room]
        Deku_Tree__Slingshot_Room__Entry(Entry);
        Deku_Tree__Slingshot_Room__Slingshot(Slingshot);
    end
    subgraph Deku_Tree__Slingshot_Upper[Slingshot Upper]
        Deku_Tree__Slingshot_Upper__Ledge(Ledge);
    end
    subgraph Deku_Tree__Floor_3[Floor 3]
        Deku_Tree__Floor_3__Climb(Climb);
        Deku_Tree__Floor_3__Door(Door);
    end
    subgraph Deku_Tree__Compass_Room[Compass Room]
        Deku_Tree__Compass_Room__Entry(Entry);
        Deku_Tree__Compass_Room__Compass(Compass);
        Deku_Tree__Compass_Room__Ledge(Ledge);
    end
    subgraph Deku_Tree__Basement_1[Basement 1]
        Deku_Tree__Basement_1__Center(Center);
        Deku_Tree__Basement_1__Corner(Corner);
        Deku_Tree__Basement_1__South_Door(South Door);
    end
    subgraph Deku_Tree__Back_Room[Back Room]
        Deku_Tree__Back_Room__South(South);
        Deku_Tree__Back_Room__Northwest(Northwest);
        Deku_Tree__Back_Room__East(East);
    end
    subgraph Deku_Tree__Skull_Room[Skull Room]
        Deku_Tree__Skull_Room__Entry(Entry);
    end
    subgraph Deku_Tree__Basement_Ledge[Basement Ledge]
        Deku_Tree__Basement_Ledge__Block(Block);
        Deku_Tree__Basement_Ledge__Web(Web);
    end
    subgraph Deku_Tree__Basement_2[Basement 2]
        Deku_Tree__Basement_2__Pool(Pool);
        Deku_Tree__Basement_2__Boss_Door(Boss Door);
    end
    subgraph Deku_Tree__Boss_Room[Boss Room]
        Deku_Tree__Boss_Room__Entry(Entry);
        Deku_Tree__Boss_Room__Arena(Arena);
    end
end
subgraph KF
    subgraph KF__Links_House[Link's House]
        KF__Links_House__Start_Point(Start Point);
        KF__Links_House__Entry(Entry);
    end
    subgraph KF__Kokiri_Village[Kokiri Village]
        KF__Kokiri_Village__Links_Porch(Link's Porch);
        KF__Kokiri_Village__Midos_Porch(Mido's Porch);
        KF__Kokiri_Village__Know_it_all_Porch(Know-it-all Porch);
        KF__Kokiri_Village__Training_Center(Training Center);
        KF__Kokiri_Village__Shop_Porch(Shop Porch);
        KF__Kokiri_Village__Sarias_Porch(Saria's Porch);
        KF__Kokiri_Village__Midos_Guardpost(Mido's Guardpost);
    end
    subgraph KF__Boulder_Maze[Boulder Maze]
        KF__Boulder_Maze__Entry(Entry);
        KF__Boulder_Maze__Reward(Reward);
    end
    subgraph KF__Baba_Corridor[Baba Corridor]
        KF__Baba_Corridor__Village_Side(Village Side);
        KF__Baba_Corridor__Deku_Babas(Deku Babas);
        KF__Baba_Corridor__Tree_Side(Tree Side);
    end
    subgraph KF__Outside_Deku_Tree[Outside Deku Tree]
        KF__Outside_Deku_Tree__Entry(Entry);
        KF__Outside_Deku_Tree__Left(Left);
        KF__Outside_Deku_Tree__Right(Right);
        KF__Outside_Deku_Tree__Mouth(Mouth);
    end
    subgraph KF__Midos_House[Mido's House]
        KF__Midos_House__Entry(Entry);
    end
    subgraph KF__Know_it_all_House[Know-it-all House]
        KF__Know_it_all_House__Entry(Entry);
    end
    subgraph KF__Shop[Shop]
        KF__Shop__Entry(Entry);
    end
end
subgraph Kak
    subgraph Kak__Spider_House[Spider House]
        Kak__Spider_House__Entry(Entry);
    end
end
KF__Baba_Corridor__Village_Side <--> KF__Kokiri_Village__Midos_Guardpost
KF__Kokiri_Village__Shop_Porch <--> KF__Shop__Entry
Deku_Tree__Floor_2__Vines --> Deku_Tree__Lobby__Entry
KF__Kokiri_Village__Sarias_Porch <--> Kak__Spider_House__Entry
KF__Kokiri_Village__Midos_Porch <--> KF__Midos_House__Entry
Deku_Tree__Floor_2__Vines --> Deku_Tree__Lobby__Center
Deku_Tree__Scrub_Room__Rear <--> Deku_Tree__Slingshot_Room__Entry
Deku_Tree__Basement_1__Corner <--> Deku_Tree__Basement_Ledge__Block
KF__Baba_Corridor__Tree_Side <--> KF__Outside_Deku_Tree__Entry
Deku_Tree__Floor_2__Slingshot_Door --> Deku_Tree__Lobby__Entry
Deku_Tree__Floor_2__Lower --> Deku_Tree__Lobby__Center
KF__Outside_Deku_Tree__Mouth --> Deku_Tree__Lobby__Entry
Deku_Tree__Floor_2__Vines --> Deku_Tree__Floor_3__Climb
Deku_Tree__Floor_2__Slingshot_Door <--> Deku_Tree__Scrub_Room__Entry
Deku_Tree__Compass_Room__Entry <--> Deku_Tree__Floor_3__Door
Deku_Tree__Floor_2__Slingshot_Door --> Deku_Tree__Lobby__Center
Deku_Tree__Basement_1__Center <--> Deku_Tree__Lobby__Center
Deku_Tree__Slingshot_Room__Slingshot <--> Deku_Tree__Slingshot_Upper__Ledge
Deku_Tree__Basement_2__Boss_Door --> Deku_Tree__Boss_Room__Entry
Deku_Tree__Floor_2__Vines --> Deku_Tree__Lobby__Vines
Deku_Tree__Back_Room__East --> Deku_Tree__Basement_Ledge__Web
Deku_Tree__Lobby__Center --> Deku_Tree__Basement_Ledge__Block
Deku_Tree__Basement_1__South_Door --> Deku_Tree__Back_Room__South
Deku_Tree__Basement_2__Pool <--> Deku_Tree__Basement_Ledge__Web
Deku_Tree__Back_Room__Northwest <--> Deku_Tree__Skull_Room__Entry
Deku_Tree__Floor_2__Lower <--> Deku_Tree__Lobby__Vines
KF__Boulder_Maze__Entry <--> KF__Kokiri_Village__Training_Center
Deku_Tree__Floor_3__Door --> Deku_Tree__Lobby__Center
KF__Kokiri_Village__Links_Porch <--> KF__Links_House__Entry
KF__Know_it_all_House__Entry <--> KF__Kokiri_Village__Know_it_all_Porch
